38-auth/server/app/controllers/api/v1/paintings_controller.rb

SELECT "paintings".* FROM "paintings"
---
  def index
    if !logged_in?
      render json: {error: "You must be logged in to see these paintings."}
      return
    end

    @paintings = Painting.all