30-rails-as-an-api/pokemon-teams-backend/app/controllers/pokemons_controller.rb

SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = $1  [["trainer_id", 1]]
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "pokemons" WHERE "pokemons"."trainer_id" = $1  [["trainer_id", 5]]
INSERT INTO "pokemons" ("species", "nickname", "trainer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["species", "Porygon"], ["nickname", "Yong"], ["trainer_id", 5], ["created_at", "2019-09-06 18:15:56.807554"], ["updated_at", "2019-09-06 18:15:56.807554"]]
---
  def create
    @trainer = Trainer.find(params[:trainer_id])
    if @trainer.pokemons.count >= 6
      NULL #need error handling
    else
      @pokemon = Pokemon.new(pokemon_params)
      @pokemon.nickname = Faker::Name.first_name
      @pokemon.species = Faker::Games::Pokemon.name
      @pokemon.save

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = $1  [["id", 1]]
---
  def destroy
    @pokemon = Pokemon.find(params[:id])
    @pokemon.destroy